import React, { useEffect, useState } from "react";
import "./calendar.scss";
import Calendar from "./Calendar";
import { requestGet } from "../../actions/actions";
import _ from "lodash";

export default function CalendarContainer() {
  const [data, setData] = useState<any>(null);

  useEffect(() => {
    getData();
    // eslint-disable-next-line react-hooks/exhaustive-deps
  }, []);

  const formattedDate = (date: any) => {
    const splitedDate = date.split("T");
    const splitedYear = splitedDate[0].split("-")[0];
    const splitedMonth = splitedDate[0].split("-")[1];
    const splitedDay = splitedDate[0].split("-")[2];

    return `${splitedDay}-${splitedMonth}-${splitedYear}T${splitedDate[1]}`;
  };

  const getData = async () => {
    const newData: any = await requestGet(`container/mainCalendar`);

    if (newData) {
      const sendData: any = _.cloneDeep(newData.items.data);

      sendData.forEach((item: any) => {
        item.eventDate = formattedDate(item.eventDate);

        item.dates = item.dates.map((date: any) => {
          return formattedDate(date);
        });
      });

      setData(sendData);
    }
  };

  const mainDate: string = "01-02-2025T00:00:00"; // первоначальная дата
  // const data: CalendarType[] = [
  //   {
  //     id: "1",
  //     date: "03-02-2025T00:00:00",
  //     type: "events",
  //     text: "Профориентация: индивидуальные консультации",
  //     dates: [
  //       "03-02-2025T00:00:00",
  //       "04-02-2025T00:00:00",
  //       "05-02-2025T00:00:00",
  //       "06-02-2025T00:00:00",
  //       "07-02-2025T00:00:00",
  //       "10-02-2025T00:00:00",
  //       "11-02-2025T00:00:00",
  //       "12-02-2025T00:00:00",
  //       "13-02-2025T00:00:00",
  //       "14-02-2025T00:00:00",
  //       "15-02-2025T00:00:00",
  //       "17-02-2025T00:00:00",
  //       "18-02-2025T00:00:00",
  //       "19-02-2025T00:00:00",
  //       "20-02-2025T00:00:00",
  //       "21-02-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "2",
  //     date: "06-02-2025T00:00:00",
  //     type: null,
  //     text: "Англ.яз: тест на определение уровня языка",
  //     dates: [],
  //   },
  //   {
  //     id: "3",
  //     date: "07-02-2025T00:00:00",
  //     type: "meeting",
  //     text: "Открытие сайта Англ.язык: пробный урок",
  //     dates: [],
  //   },
  //   {
  //     id: "4",
  //     date: "10-02-2025T00:00:00",
  //     type: null,
  //     text: "Англ.язык: асинхронный урок мотивационное письмо",
  //     dates: [],
  //   },
  //   {
  //     id: "5",
  //     date: "15-02-2025T00:00:00",
  //     type: null,
  //     text: "Англ.язык: zoom-встреча урок мотивационное письмо",
  //     dates: [],
  //   },
  //   {
  //     id: "6",
  //     date: "21-02-2025T00:00:00",
  //     type: "meeting",
  //     text: "Zoom-встреча с представителями университета SDU 19:30ч",
  //     dates: [],
  //   },
  //   {
  //     id: "7",
  //     date: "23-02-2025T00:00:00",
  //     type: "deadline",
  //     text: "Мотивационное письмо: тест на определение уровня языка",
  //     dates: [],
  //   },
  //   {
  //     id: "8",
  //     date: "24-02-2025T00:00:00",
  //     type: "events",
  //     text: "Индивидуальные консультации",
  //     dates: [
  //       "24-02-2025T00:00:00",
  //       "25-02-2025T00:00:00",
  //       "26-02-2025T00:00:00",
  //       "27-02-2025T00:00:00",
  //       "28-02-2025T00:00:00",
  //       "03-03-2025T00:00:00",
  //       "04-03-2025T00:00:00",
  //       "05-03-2025T00:00:00",
  //       "06-03-2025T00:00:00",
  //       "07-03-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "9",
  //     date: "27-02-2025T00:00:00",
  //     type: "info",
  //     text: "Крайний срок подачи заявки в Назарбаев Университет",
  //     dates: [],
  //   },
  //   {
  //     id: "10",
  //     date: "28-02-2025T00:00:00",
  //     type: null,
  //     text: "Тесты части по англ.яз. олимпиады SDU (ISPT)",
  //     dates: [],
  //   },
  //   {
  //     id: "11",
  //     date: "01-03-2025T00:00:00",
  //     type: "meeting",
  //     text: "Zoom-встреча: даты олимпиад в конкурсов на гранты/скидки",
  //     dates: [],
  //   },
  //   {
  //     id: "12",
  //     date: "01-03-2025T00:00:00",
  //     type: "info",
  //     text: "Подача заявки в университеты AlmaU и KBTU",
  //     dates: [],
  //   },
  //   {
  //     id: "13",
  //     date: "03-03-2025T00:00:00",
  //     type: null,
  //     text: "Англ.язык: асинхронный урок разбор части по англ.яз. олимпиады SDU (ISPT)",
  //     dates: [],
  //   },
  //   {
  //     id: "14",
  //     date: "07-03-2025T00:00:00",
  //     type: null,
  //     text: "Англ.язык: zoom-встреча вопрос-ответ по части англ.яз. олимпиады SDU (ISPT)",
  //     dates: [],
  //   },
  //   {
  //     id: "15",
  //     date: "10-03-2025T00:00:00",
  //     type: "events",
  //     moretype: "meeting",
  //     text: "Встречи со студентами разных ВУЗов & направлений",
  //     dates: [
  //       "10-03-2025T00:00:00",
  //       "11-03-2025T00:00:00",
  //       "12-03-2025T00:00:00",
  //       "13-03-2025T00:00:00",
  //       "14-03-2025T00:00:00",
  //       "15-03-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "16",
  //     date: "11-03-2025T00:00:00",
  //     type: "meeting",
  //     text: "Математика: асинхронный урок разбор части по матем.-логике олимпиады SDU (ISPT)",
  //     dates: [],
  //   },
  //   {
  //     id: "17",
  //     date: "14-03-2025T00:00:00",
  //     type: "meeting",
  //     text: "Математика: zoom-урок разбор части по матем.-логике олимпиады SDU (ISPT)",
  //     dates: [],
  //   },
  //   {
  //     id: "18",
  //     date: "21-03-2025T00:00:00",
  //     type: "meeting",
  //     text: "Асинхронный урок разбор олимпиады университета NARXOZ",
  //     dates: [],
  //   },
  //   {
  //     id: "19",
  //     date: "25-03-2025T00:00:00",
  //     type: "info",
  //     text: "Конец приема заявок в университет TURAN",
  //     dates: [],
  //   },
  //   {
  //     id: "20",
  //     date: "29-03-2025T00:00:00",
  //     type: "meeting",
  //     text: "Живая встреча для абитуриентов в Якутске",
  //     dates: [],
  //   },
  //   {
  //     id: "21",
  //     date: "31-03-2025T00:00:00",
  //     type: "info",
  //     text: "Конец приема заявок в университет AlmaU",
  //     dates: [],
  //   },
  //   {
  //     id: "22",
  //     date: "11-04-2025T00:00:00",
  //     type: "meeting",
  //     moretype: "parents",
  //     text: `Психолог: zoom-встреча "Как справляться со стрессом во время экзаменов"`,
  //     dates: [],
  //   },
  //   {
  //     id: "23",
  //     date: "14-04-2025T00:00:00",
  //     type: "events",
  //     text: "Индивидуальные консультации",
  //     dates: [
  //       "14-04-2025T00:00:00",
  //       "15-04-2025T00:00:00",
  //       "16-04-2025T00:00:00",
  //       "17-04-2025T00:00:00",
  //       "18-04-2025T00:00:00",
  //       "21-04-2025T00:00:00",
  //       "22-04-2025T00:00:00",
  //       "23-04-2025T00:00:00",
  //       "24-04-2025T00:00:00",
  //       "25-04-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "24",
  //     date: "18-04-2025T00:00:00",
  //     type: "meeting",
  //     text: "Психолог: zoom-встреча",
  //     dates: [],
  //   },
  //   {
  //     id: "25",
  //     date: "21-04-2025T00:00:00",
  //     type: "meeting",
  //     text: "Асинхронный урок: Рекомендательное письмо",
  //     dates: [],
  //   },
  //   {
  //     id: "26",
  //     date: "05-05-2025T00:00:00",
  //     type: "meeting",
  //     text: "Бонус: Урок по казахскому языку и введение в историю Казахстана",
  //     dates: [],
  //   },
  //   {
  //     id: "27",
  //     date: "12-05-2025T00:00:00",
  //     type: "events",
  //     text: "Самостоятельная подготовка: Созвоны по запросу",
  //     dates: [
  //       "12-05-2025T00:00:00",
  //       "13-05-2025T00:00:00",
  //       "14-05-2025T00:00:00",
  //       "15-05-2025T00:00:00",
  //       "16-05-2025T00:00:00",
  //       "19-05-2025T00:00:00",
  //       "20-05-2025T00:00:00",
  //       "21-05-2025T00:00:00",
  //       "22-05-2025T00:00:00",
  //       "23-05-2025T00:00:00",
  //       "26-05-2025T00:00:00",
  //       "27-05-2025T00:00:00",
  //       "28-05-2025T00:00:00",
  //       "29-05-2025T00:00:00",
  //       "30-05-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "27",
  //     date: "13-06-2025T00:00:00",
  //     type: "meeting",
  //     text: `Психолог: zoom-встреча "Адаптация"`,
  //     dates: [],
  //   },
  //   {
  //     id: "28",
  //     date: "16-06-2025T00:00:00",
  //     type: "events",
  //     moretype: "meeting",
  //     text: `Финальная проверка мотивационных писем и групповые собеседования`,
  //     important: true,
  //     dates: [
  //       "16-06-2025T00:00:00",
  //       "17-06-2025T00:00:00",
  //       "18-06-2025T00:00:00",
  //       "19-06-2025T00:00:00",
  //       "20-06-2025T00:00:00",
  //       "23-06-2025T00:00:00",
  //       "24-06-2025T00:00:00",
  //       "25-06-2025T00:00:00",
  //       "26-06-2025T00:00:00",
  //       "27-06-2025T00:00:00",
  //       "30-06-2025T00:00:00",
  //       "01-07-2025T00:00:00",
  //       "02-07-2025T00:00:00",
  //       "03-07-2025T00:00:00",
  //       "04-07-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "29",
  //     date: "20-06-2025T00:00:00",
  //     type: "meeting",
  //     text: `Начало работы приемной комиссии`,
  //     important: true,
  //     dates: [],
  //   },
  //   {
  //     id: "30",
  //     date: "07-07-2025T00:00:00",
  //     type: "meeting",
  //     text: `Конец приема заявок на творческие специальности`,
  //     dates: [],
  //   },
  //   {
  //     id: "31",
  //     date: "08-07-2025T00:00:00",
  //     type: "events",
  //     text: `Творческие экзамены`,
  //     dates: [
  //       "08-07-2025T00:00:00",
  //       "09-07-2025T00:00:00",
  //       "10-07-2025T00:00:00",
  //       "11-07-2025T00:00:00",
  //       "12-07-2025T00:00:00",
  //     ],
  //   },
  //   {
  //     id: "32",
  //     date: "18-07-2025T00:00:00",
  //     type: "meeting",
  //     text: `Контрольный созвон по поступлению`,
  //     dates: [],
  //   },
  //   {
  //     id: "33",
  //     date: "11-08-2025T00:00:00",
  //     type: "meeting",
  //     text: `Прилет в Казахстан`,
  //     dates: [],
  //   },
  //   {
  //     id: "34",
  //     date: "25-08-2025T00:00:00",
  //     type: "meeting",
  //     text: `Конец работы приемной комиссии`,
  //     dates: [],
  //   },
  // ];

  return data ? <Calendar data={data} mainDate={mainDate} /> : null;
}
